#include <iostream>
#include <fstream>
#include <cstdlib>
#include <cstring>

using namespace std;

int main()
{
	ofstream fout;
	fout.open("image_request.json", ios::out);

	char name_list[33][100] = {"高贤达", "XP", "李南星", "张哲", "大帝", "光大大", "王小寒", "张凯", "吴悦欣", "贺超", "桐妈",
							"桐姐夫", "王彬彬", "可宏", "RP", "柯豪", "国家琦", "李根", "丧病", "小勇", "黄砖", "王昭", "王正",
							"京傲", "张育萌", "蔡女神", "池吃吃", "赵毅", "周立旺", "罗剑桥", "大宝剑", "大棍"};
	char comment_list[45][1000] = {"烧烧烧！",
							"秀恩爱，分的快！",
							"单身狗受到了一万点的伤害",
							"这腿我能玩一年！",
							"Orz",
							"今天的风儿有些喧嚣呀",
							"来，干了这碗汤！",
							"星老师没拉裤链！",
							"你们城里人真会玩",
							"你们乡下人话真多",
							"每一个不想谈恋爱的人，心里都住着一个不可能的人",
							"你若赐我一段浮华，我便许你满世繁花",
							"风很凉,天很蓝,我站在寸草不生的草地上遥望远方的夕阳",
							"今日的阳光就像向日葵里的沉思的蛐蛐。",
							"穿着公主裙,赤着脚在曼陀罗旁跳舞",
							"我把你的名字写在烟上,抽进肺里",
							"一切的一切就像一个传说,我是那传说中的王子,打马从垣上掠过",
							"你是那个要我守护一辈子的公主吗",
							"白是那么地云，蓝是那么地天。",
							"你会不会闭着眼睛在黑夜里飞行?",
							"而我还在这,观赏,这些如夏花般盛开着感伤气味的文青。",
							"望向镜中的自己，水汽弥漫。",
							"有一天，背起行囊，向远方流浪。",
							"寂寞如斯，甜到哀伤",
							"你站的方向吹过来的风是暖的",
							"FFF异端审问团都开始行动了",
							"人类情感的极致，比希望更火热，比绝望更深切的东西......是爱。",
							"只为自己而活的话，所有东西就由自己来承担。",
							"把感谢和责任混为一谈是不行的。",
							"奇迹这东西，并不是免费的，祈求希望的话就会散布同样分量的绝望。",
							"我们仰望著同一片天空却看著不同的地方。",
							"伸手可见的距离，却不能到达的那个地方。",
							"只是活着，悲伤就会逐渐堆积。",
							"我现在依然喜欢着你，但就算我们来往一千封短信，心却不过接近仅仅一厘米。",
							"谁都不可能和谁在一起一辈子。人就是这样，必须去习惯失去。",
							"人啊，总是盲目地去爱啊",
							"这个世界上最接近恶魔的生物应该就是人类了。",
							"心在哭泣，眼睛却流不出泪水。",
							"笑是对身边的事物感到一瞬间的幸福而表现出来的东西。",
							"人的每一天都在互相伤害中度过的，所以难免会怀疑他人。",
							"我在人生道路上迷失了方向",
							"人总有一天会死的，但正因为生命是有限的，才能够欢喜和悲伤",
							"不想哭就只有变强了，无论发生什么都不会掉泪的坚强。",
							"随着时光流逝，痛苦也会消失。但是，我并不想让时间来治愈一切。就算想从疼痛中逃走，忘记一切，但等待我们的，也只有停滞不前。",
							"突然之间，我还想再在这个世上多活几天。"};
				
	char describe_list[17][1000] = ["就是来秀的你们来打我呀",
							 "我们。",
							 "Hello World",
							 "我是一张图片",
							 "图文无关",
							 "你终有一天会发现的，生命的名字叫做徒劳。",
							 "情若能自控，怎么会心痛。",
							 "尽管记忆再悲伤，我们却笑着，不愿遗忘。",
							 "我们注定擦肩，我们注定相守。",
							 "先森。我爱你爱了整整一个夏天",
							 "八千米海岸七厘米蔚蓝",
							 "爱可以让你直面阳光 这样就不会有阴影",
							 "前方是深海后退是无岸你叫我如何选",
							 "你的灵魂太空旷了，寂静的只剩下回声。",
							 "心是一座空城 空袭了一身蔓延荒芜 由此站成孤寂悲悯的身影",
							 "山有木兮木有枝，心悦君惜君不知",
							 "兵荒马乱的青春,夹杂着我们歇斯底里的无所适从",
							 "太阳尚远，但必有太阳。",
							 "这个城市被黑白刷新着，遇见了谁，经过了谁，想念了谁，盼望着谁，憎恨着谁，又对谁无能为力。",
							 "得到的时候你在毁，失去的时候你在悔",
							 "城市的幻影有千百种",
							 "若此生，得不到，护不了，吾宁愿此生孤独到老。",
							 "因为爱你，是我最初许下的誓言。",
							 "青梅已故，竹马已老，从此，我们分道扬镳。",
							 "无关他人 只怪你我情不及浅水深。",
							 "心一动，泪两行，从此为君不设防。",
							 "我似乎爱上你了，我看着你睫毛下的阴影都有跳色的温柔。"};

	fout << "[" << endl;
	for (int i = 1; i <= 50; i ++)
	{
		int comment_cnt = rand() % 4 + 1;
		fout << "\t{bigurl: \"./images/" << i << ".jpg\"," << endl;
		fout << "\t miniurl: \"./images/mini" << i << ".jpg\"," << endl;
		fout << "\t latitude: " << double(rand()) / RAND_MAX * 90 + "," << endl;
		fout << "\t longitude: " << double(rand()) / RAND_MAX * 180 + "," << endl;
		fout << "\t commenturl: [" << endl;
		for (int j = 1; j <= comment_cnt; j ++)
		{
			fout <<"\t\t \"./jsons/image_comment_" << i << "_" << j <<".json\"";
			if (j < comment_cnt) fout << ",";
			fout << endl;

			ofstream comout;
			string filename = "image_comment_";
			char buf[10];
			sprintf(buf, "%d", i);
			filename.append(buf);
			filename.append("_");
			sprintf(buf, "%d", j);
			filename.append(buf);
			filename.append(".json");
			comout.open(filename);

			comout << "[" << endl;
			for (int k = 0; k < 5; k ++)
			{
				comout << "{\"name\": \"" << name_list[random() % name_cnt] << "\", comment: \"" << comment_list[random() % comment_cnt]  << "\"}";
				if (k != 4) comout << ',';
				comout << endl;
			}
			comout << "]" << endl;

			comout.close();
		}
		fout << "]}";
		if (i != 50) fout << ",";
		fout << endl;
	}
	fout << "]" << endl;

	fout.close();
	return 0;
}
